#ifndef __ide_h__
#define __ide_h__
#include <stdio.h>

#ifdef __cplusplus
extern "C"
{
#endif

#ifndef BYTE
typedef unsigned char BYTE;
#endif

#ifndef WORD
typedef unsigned short WORD;
#endif
#ifndef DWORD
typedef unsigned long DWORD;
#endif

#define IDE_CMD_NOP                    0
#define IDE_CMD_NOT_IMPLEMENTED1       1 
#define IDE_CMD_NOT_IMPLEMENTED2       2
#define IDE_CMD_NOT_IMPLEMENTED3       3
#define IDE_CMD_NOT_IMPLEMENTED4       4
#define IDE_CMD_NOT_IMPLEMENTED5       5
#define IDE_CMD_NOT_IMPLEMENTED6       6
#define IDE_CMD_NOT_IMPLEMENTED7       7
#define IDE_CMD_DEVICE_RESET           8
#define IDE_CMD_NOT_IMPLEMENTED9       9
#define IDE_CMD_NOT_IMPLEMENTEDa       0xa
#define IDE_CMD_NOT_IMPLEMENTEDb       0xb
#define IDE_CMD_NOT_IMPLEMENTEDc       0xc
#define IDE_CMD_NOT_IMPLEMENTEDd       0xd
#define IDE_CMD_NOT_IMPLEMENTEDe       0xe
#define IDE_CMD_NOT_IMPLEMENTEDf       0xf

#define IDE_CMD_RECALIB       0x10
#define IDE_CMD_RECALIB1      0x11 
#define IDE_CMD_RECALIB2      0x12
#define IDE_CMD_RECALIB3      0x13
#define IDE_CMD_RECALIB4      0x14
#define IDE_CMD_RECALIB5      0x15
#define IDE_CMD_RECALIB6      0x16
#define IDE_CMD_RECALIB7      0x17
#define IDE_CMD_RECALIB8      0x18
#define IDE_CMD_RECALIB9      0x19
#define IDE_CMD_RECALIBa      0x1a
#define IDE_CMD_RECALIBb      0x1b
#define IDE_CMD_RECALIBc      0x1c
#define IDE_CMD_RECALIBd      0x1d
#define IDE_CMD_RECALIBe      0x1e
#define IDE_CMD_RECALIBf      0x1f


//|       | 6 |1=fixed drive 
//|       | 5 |1=spindle motor control option implemented 
//|       | 4 |1=head switch time > 15 usec 
//|       | 3 |1=not MFM encoded 
//|       | 2 |1=soft sectored 
//|       | 1 |1=hard sectored 
//|       | 0 |0=reserved 
//| 1     | Number of cylinders 
//| 2     | Reserved 
//| 3     | Number of heads 
//| 4     | Number of unformatted bytes per track 
//| 5     | Number of unformatted bytes per sector 
//| 6     | Number of sectors per track 
//| 7-9   | Vendor unique 
//| 10-19 | Serial number (20 ASCII characters, 0000h=not specified) 
//| 20    | Buffer type 
//| 21    | Buffer size in 512 byte increments (0000h=not specified) 
//| 22    | # of ECC bytes avail on read/write long cmds (0000h=not spec'd) 
//| 23-26 | Firmware revision (8 ASCII characters, 0000h=not specified) 
//| 27-46 | Model number (40 ASCII characters, 0000h=not specified) 
//| 47    | 15-8 Vendor unique 
//|       | 7-0 00h = Read/write multiple commands not implemented 
//|       | xxh = Maximum number of sectors that can be transferred 
//|       | per interrupt on read and write multiple commands 
//| 48    | 0000h = cannot perform doubleword I/O Included for backwards 
//|       | 0001h = can perform doubleword I/O Compatible VU use 
//| 49    | Capabilities
//|       | 15-10 0=reserved 
//|       | 9 1=LBA supported 
//|       | 8 1=DMA supported 
//|       | 7- 0 Vendor unique 
//| 50    | Reserved 
//| 51    | 15-8 PIO data transfer cycle timing mode 
//|       | 7-0 Vendor unique 
//| 52    | 15-8 DMA data transfer cycle timing mode 
//|       | 7-0 Vendor unique 
//| 53    | 15-1 Reserved 
//|       | 0 1=the fields reported in words 54-58 are valid 
//|       |   0=the fields reported in words 54-58 may be valid 
//| 54    | Number of current cylinders 
//| 55    | Number of current heads 
//| 56    | Number of current sectors per track 
//| 57-58 | Current capacity in sectors 
//| 59    | 15-9 Reserved 
//|       | 8 1 = Multiple sector setting is valid 
//|       | 7-0 xxh = Current setting for number of sectors that can be 
//|       | transferred per interrupt on R/W multiple commands 
//| 60-61 | Total number of user addressable sectors (LBA mode only) 
//| 62    | 15-8 Single word DMA transfer mode active 
//|       | 7-0 Single word DMA transfer modes supported (see 11-3a) 
//| 63    | 15-8 Multiword DMA transfer mode active 
//|       | 7-0 Multiword DMA transfer modes supported (see 11-3b) 
//| 64-74 | zeroed 
//| 75    | Queue depth
//|76-79  | zeroed
//|  80   | Major version number
//|  81   | Minor version number
//| 82-87 | Command set supported.
//| 88    | Ultra DMA modes
//| 89-99 | zeroed.
//|100-103| Maximum user LBA for 48-bit Address feature set.
//|104-126| zeroed 
//|  127  | Removable Media Status Notification feature set support
//| 128   | Security status
//|129-159| Vendor unique 
//|160-175| zeroed 
//|176-205| Current media serial number
//|206-254| zeroed 
//|  255  | Checksum/signature
typedef struct disk_info_def
{
	unsigned short general_config;    //0x8080:fixed disk
	unsigned short cylinders;         //
	unsigned short reserved;          //
	unsigned short heads;             // 8
	unsigned short bytes_per_track;   //0x8000;
	unsigned short bytes_per_sector;  //0x200; 
	unsigned short sectors_per_track; //0x40;
	unsigned short vendor_unique[3];  //
	unsigned char  serial[20];        //
	unsigned short buffer_type;
	unsigned short buffer_size;
	unsigned short ecc_bytes;
	unsigned char  firmware_revision [8];
	unsigned char  model_number[40];

	unsigned char  multiple_rw;        // 
	unsigned char  vendor_unique0;     // msb of word47

	unsigned short dword_io;           // 0:not support double word io
	unsigned short caps;               // 0x2000
	unsigned short word50;

	unsigned char  vendor_unique1;      // 
	unsigned char  pio_timing_mode;     // msb of word51


	unsigned char  vendor_unique2;      // 
	unsigned char  dma_timing_mode;     // msb of word52

	unsigned short flag_w53; 
	unsigned short number_of_current_cylinders;
	unsigned short current_heads;
	unsigned short current_sectors_per_track;
	unsigned long  capacity_in_sectors;
	unsigned char  sectors_in_multi_rw;
	unsigned char  multi_sector_setting_valid;

	unsigned long  total_sectors;
	unsigned char  single_word_dma_supported;
	unsigned char  single_word_dma_active;
	unsigned char  multi_word_dma_supported;
	unsigned char  multi_word_dma_active;
	unsigned short word64_to_74[74-63];         //64~74
	unsigned short queue_depth;                 //75
	unsigned short word76_to_79[79-75];         //76~79
	unsigned short major_version;
	unsigned short minor_version;
	unsigned short word82_to_87[87-81];         //82~87
	unsigned short ultra_dma_modes;
	unsigned short word89_to_99[99-88];         //89~99
	unsigned long  max_lba_lo;
	unsigned long  max_lba_hi;
	unsigned short word104_to_126[126-103];         //104~126
	unsigned short media_status_notify;            //127
	unsigned short security_status;                //128
	unsigned short word129_to_175[175-128];        // 129~175
	unsigned short media_serial_number[205-175];        // 176~205
	unsigned short word206_to_254[254-205];             // 206~254
	unsigned char  signature;
	unsigned char  checksum;

}DISK_INFO;


//7.2.1 Alternate status register
//This register contains the same information as the Status Register in the
//command block. The only difference being that reading this register does not
//imply interrupt acknowledge or clear a pending interrupt.
//|   7 | 6    |  5  |  4  |  3  |   2  |  1  |  0  |
//|-----+------+-----+-----+-----+------+-----+-----|
//| BSY | DRDY | DWF | DSC | DRQ | CORR | IDX | ERR |
typedef struct alteratestatus_reg
{
unsigned char ERR:1;
unsigned char IDX:1;
unsigned char CORR:1;
unsigned char DRQ:1;
unsigned char DSC:1;
unsigned char DWF:1;
unsigned char DRDY:1;
unsigned char BSY:1;

}STATUS_REG;


//7.2.6 Device control register
